import matplotlib.pyplot as plt
import numpy as np

# mu - Задаємо середнє значення та стандартне відхилення
mu, sigma = 115, 15

# Генеруємо 10 000 випадкових значень із нормальним розподілом
x = mu + sigma * np.random.randn(10000)

fig, ax = plt.subplots(figsize=(5,2.7), layout="constrained")

# x - вхідні дані
# 50 - кількість стовпчиків
# density -нормалізація гістограму до імовірності
# facecolor - C0 - Колір синій стовпчиків
# alpha - прозорість 75 відсотків
n, bins, patches = ax.hist(x,50,density=True,facecolor="C0", alpha=0.75)

ax.set_xlabel("Довжина [см]")

ax.set_ylabel("Ймовірність")

# Додаємо заголовок графіка
ax.set_title('Розподіл довжин трубкозубів\n(умовний приклад)')

# Додаємо текст із параметрами нормального розподілу
# r'' означає "сирий" рядок, що використовується для математичних формул
ax.text(75, 0.025, r'$\mu=115,\ \sigma=15$')

# Встановлюємо межі графіка:
# [мінімум X, максимум X, мінімум Y, максимум Y]
ax.axis([55, 175, 0, 0.03])

# Вмикаємо сітку для зручності читання графіка
ax.grid(True)

# Відображаємо гістограму
plt.show()