import pandas as pd
import numpy as np

# s = pd.Series([20, 40, 60, 80, 100])
# print("Series\n", s)

# Можна вказувати свої індекси для елементів
# s = pd.Series([20, 40, 60], index=['A', 'B', 'C'])
# print("Series\n", s)
# Запишемо масив у Pandas
# data = {"Київ": 328, "Львів": 210, "Тернопіль": 160}
# s = pd.Series(data)
# print("Словник\n", s)

# s = pd.Series(12, index=['a', 'b', 'c', 'd'])
# print("Константа\n", s)

# - доступ до даних у Pandas
# s = pd.Series([20, 30, 60], index=['a', 'b', 'c'])
# print(s[0]) # Буде помилка, бо індексу немає
# print(s['a']) # Звертаємося до індексу
# print(s.iloc[0]) # За позцією у списку
# print(s[0:2]) # зріз по даних

# Працюємо із табличними даними
# data = {
#     'Ім\'я': ["Іванка", "Олеся", "Хрестина"],
#     "Вік": [16, 18, 21],
#     "Місто": ["Луцьк", "Рівне", "Львів"]
# }
# df = pd.DataFrame(data)
# print(df)

# data = [
#     {"Ім\'я": "Іванка", "Вік": 35, "Місто": "Київ"},
#     {"Ім\'я": "Матвій", "Вік": 25, "Місто": "Рівне"},
#     {"Ім\'я": "Юлік", "Вік": 30, "Місто": "Львів"}
# ]
# df = pd.DataFrame(data)
# print(df)

# data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
# df = pd.DataFrame(data,
#                   columns=['A', 'B', 'C']
#                   index=["рядок 1", "рядок 2", "рядок 3"])
# print(df)

# s1 = pd.Series[1, 2, 3]
# s2 = pd.Series[4, 5, 6]
# df = pd.DataFrame({"col1": s1, "col2": s2})
# print(df)

# sales_data = {
#     'Дата': pd.date_range('2024-01-01', periods=10, freq='D'),
#     'Продукти': ['Ноутбуки', 'Телефон', 'Планшет', 'Навушники', 'Клавіатура', 'Миша', 'Ноутбуки', 'Телефон', 'Планшет'],
#     'Кількість': [2, 3, 5, 10, 7, 15, 1, 3, 4, 2],
#     'Ціна': [25000, 15000, 12000, 2000, 1500, 500, 8000, 25000, 15000, 12000],
#     'Регіон': ['Київ', 'Львів', 'Одеса', 'Київ', 'Харків', 'Львів', 'Київ', 'Одеса', 'Харків', 'Львів']
# }

# df_sales = pd.DataFrame(sales_data)
# print(df_sales)
# print()

# Запис у csv
# print("== Запис у CSV ==")
# df_sales.to_csv('sales.csv', index=False, encoding='utf-8')
# print("Збережено у CSV")
# print()

#Читання із csv
# print("=== Читання CSV ===")
# df_sales = pd.read_csv('sales.csv')
# print("Прочитані дані з файлу:")
# print(df_sales.head(3))
# print()

# -- практична --
# завдання 1

print("-- практична --")
data = [
    {"Ім\'я": "Іванка", "Вік": 35, "Місто": "Київ"},
    {"Ім\'я": "Матвій", "Вік": 25, "Місто": "Рівне"},
    {"Ім\'я": "Юлік", "Вік": 30, "Місто": "Львів"},
    {"Ім\'я": "Юрій", "Вік": 27, "Місто": "Тернопіль"},
    {"Ім\'я": "Вероніка", "Вік": 24, "Місто": "Одеса"}
]
df = pd.DataFrame(data)
print(df)
rows, cols = df.shape
print(f"Рядків: {rows}, Стовпців: {cols}")
print("Назви стовпців:", list(df.columns))
print("Перші 3 рядки:\n", df.head(3))

# завдання 2

df = pd.read_csv('movies.csv')
print("Перші 5 рядків:\n", df.head(5))
rows, cols = df.shape
print(f"Рядків: {rows}, Стовпців: {cols}")
print(f"Типи даних:\n{df.dtypes}")
print(f"Пропуски:\n{df.isna().sum()}")

# завдання 3

data = [
    {"Ім'я": "Олена", "Вік": 28, "Відділ": "Маркетинг", "Зарплата": 45000},
    {"Ім'я": "Олексій", "Вік": 35, "Відділ": "IT", "Зарплата": 75000},
    {"Ім'я": "Тетяна", "Вік": 42, "Відділ": "Бухгалтерія", "Зарплата": 52000},
    {"Ім'я": "Максим", "Вік": 24, "Відділ": "IT", "Зарплата": 48000},
    {"Ім'я": "Ірина", "Вік": 31, "Відділ": "HR", "Зарплата": 38000},
    {"Ім'я": "Дмитро", "Вік": 29, "Відділ": "Продажі", "Зарплата": 60000},
    {"Ім'я": "Марія", "Вік": 38, "Відділ": "Маркетинг", "Зарплата": 55000}
]
df = pd.DataFrame(data)
high_salary_df = df[df["Зарплата"] > 50000]
print(f"Співробітники з зарплатою більшою за 50000:\n{high_salary_df}")
sorted_by_age = df.sort_values(by="Вік", ascending=True)
print(f"Сортування за віком (за зростанням):\n{sorted_by_age}")
sorted_by_salary = df.sort_values(by="Зарплата", ascending=False)
print(f"Сортування за зарплатою (за спаданням):\n{sorted_by_salary}")

# завдання 4

data = [
    {"Товар": "Ноутбук", "Категорія": "Електроніка", "Ціна": 25000, "Кількість": 3},
    {"Товар": "Смартфон", "Категорія": "Електроніка", "Ціна": 12000, "Кількість": 5},
    {"Товар": "Кавомашина", "Категорія": "Побутова техніка", "Ціна": 8500, "Кількість": 2},
    {"Товар": "Крісло", "Категорія": "Меблі", "Ціна": 4500, "Кількість": 4},
    {"Товар": "Мишка", "Категорія": "Електроніка", "Ціна": 600, "Кількість": 10},
    {"Товар": "Пилосос", "Категорія": "Побутова техніка", "Ціна": 5300, "Кількість": 3},
    {"Товар": "Стіл", "Категорія": "Меблі", "Ціна": 6000, "Кількість": 2},
    {"Товар": "Монітор", "Категорія": "Електроніка", "Ціна": 7000, "Кількість": 4},
    {"Товар": "Мікрохвильовка", "Категорія": "Побутова техніка", "Ціна": 4000, "Кількість": 3},
    {"Товар": "Шафа", "Категорія": "Меблі", "Ціна": 11000, "Кількість": 1},
    {"Товар": "Клавіатура", "Категорія": "Електроніка", "Ціна": 1500, "Кількість": 6},
    {"Товар": "Тостер", "Категорія": "Побутова техніка", "Ціна": 1200, "Кількість": 5}
]
df = pd.DataFrame(data)
print(f"Оригінал:\n{df}")
df["Виручка"] = df["Ціна"] * df["Кількість"]
print(f"З колонкою \"Виручка\":\n{df}")

# завдання 5

data = [
    {"Ім'я": "Андрій", "Курс": 1, "Оцінка": 85},
    {"Ім'я": "Ольга", "Курс": 2, "Оцінка": 92},
    {"Ім'я": "Ігор", "Курс": 1, "Оцінка": 78},
    {"Ім'я": "Світлана", "Курс": 3, "Оцінка": 95},
    {"Ім'я": "Микола", "Курс": 2, "Оцінка": 64},
    {"Ім'я": "Олена", "Курс": 3, "Оцінка": 88},
    {"Ім'я": "Василь", "Курс": 1, "Оцінка": 90},
    {"Ім'я": "Наталія", "Курс": 2, "Оцінка": 73},
    {"Ім'я": "Дмитро", "Курс": 3, "Оцінка": 81},
    {"Ім'я": "Ганна", "Курс": 1, "Оцінка": 92}
]
df = pd.DataFrame(data)
course_stats = df.groupby("Курс")["Оцінка"].agg(["mean", "max", "min"])
course_stats.columns = ["Середня оцінка", "Максимальна оцінка", "Мінімальна оцінка"]
print(course_stats)

# завдання 6

products_data = [
    {"ID": 101, "Назва": "Монітор", "Ціна": 7000},
    {"ID": 102, "Назва": "Клавіатура", "Ціна": 1500},
    {"ID": 103, "Назва": "Мишка", "Ціна": 600},
    {"ID": 104, "Назва": "Навушники", "Ціна": 2200},
    {"ID": 105, "Назва": "Ноутбук", "Ціна": 28000},
    {"ID": 106, "Назва": "Принтер", "Ціна": 9500},
    {"ID": 107, "Назва": "Флешка", "Ціна": 4500}
]
df_products = pd.DataFrame(products_data)
sales_data = [
    {"ID": 101, "Кількість": 5},
    {"ID": 102, "Кількість": 12},
    {"ID": 103, "Кількість": 20},
    {"ID": 104, "Кількість": 8},
    {"ID": 105, "Кількість": 3},
    {"ID": 106, "Кількість": 2},
    {"ID": 107, "Кількість": 15}
]
df_sales = pd.DataFrame(sales_data)
print(f"Таблиця \"Товари\":\n{df_products}")
print(f"Таблиця \"Продажі\":\n{df_sales}")
df_merged = pd.merge(df_products, df_sales, on="ID", how="inner")
df_merged["Сума"] = df_products["Ціна"] * df_sales["Кількість"]
print(f"Об\'єднана таблиця:\n{df_merged}")

# -- домашня --
# завдання 1

print("-- домашня --")
data = [
    {"Назва": "Залишенець. Чорний ворон", "Автор": "Василь Шкляр", "Рік видання": 2009, "Ціна": 250},
    {"Назва": "Інтернат", "Автор": "Сергій Жадан", "Рік видання": 2017, "Ціна": 320},
    {"Назва": "Тигролови", "Автор": "Іван Багряний", "Рік видання": 1944, "Ціна": 180},
    {"Назва": "Я бачу, вас цікавить пітьма", "Автор": "Ілларіон Павлюк", "Рік видання": 2020, "Ціна": 450},
    {"Назва": "Танець недоумка", "Автор": "Макс Кідрук", "Рік видання": 2019, "Ціна": 380},
    {"Назва": "Фелікс Австрія", "Автор": "Софія Андрухович", "Рік видання": 2014, "Ціна": 290},
    {"Назва": "Місто", "Автор": "Валер'ян Підмогильний", "Рік видання": 1928, "Ціна": 150}
]
df = pd.DataFrame(data)
print(f"Книги:\n{df}")
average_price = df["Ціна"].mean()
print(f"Середня ціна книг: {round(average_price, 2)}")
high_year_df = df[df["Рік видання"] > 2015]
print(f"Книги видані після 2015 року:\n{high_year_df}")
sorted_by_price = df.sort_values(by="Ціна", ascending=True)
print(f"Книги відсортовані по ціні:\n{sorted_by_price}")

# завдання 2

df = pd.read_csv('orders.csv')
print("Перші 10 рядків:\n", df.head(10))
order_stats = df.groupby("Клієнт")["Номер замовлення"].agg(["count"])
order_stats.columns = ["Кількість замовлень"]
print(order_stats)
print(f"Максимальна сума замовлення: {df["Сума"].max()}")
print(f"Мінімальна сума замовлення: {df["Сума"].min()}")
print(f"Сума всіх замовлень: {df["Сума"].sum()}")

# завдання 3

data = [
    {"Продукт": "Куряче філе", "Категорія": "М'ясо", "Калорії": 113, "Білки": 23.6},
    {"Продукт": "Яблуко", "Категорія": "Фрукти", "Калорії": 52, "Білки": 0.3},
    {"Продукт": "Яйце куряче", "Категорія": "Продукти тваринництва", "Калорії": 157, "Білки": 12.7},
    {"Продукт": "Лосось", "Категорія": "Риба", "Калорії": 208, "Білки": 20.0},
    {"Продукт": "Сир кисломолочний", "Категорія": "Молочні продукти", "Калорії": 159, "Білки": 18.0},
    {"Продукт": "Банан", "Категорія": "Фрукти", "Калорії": 89, "Білки": 1.1},
    {"Продукт": "Броколі", "Категорія": "Овочі", "Калорії": 34, "Білки": 2.8},
    {"Продукт": "Гречка", "Категорія": "Крупи", "Калорії": 343, "Білки": 13.0},
    {"Продукт": "Мигдаль", "Категорія": "Горіхи", "Калорії": 579, "Білки": 21.2},
    {"Продукт": "Яловичина", "Категорія": "М'ясо", "Калорії": 250, "Білки": 26.0},
    {"Продукт": "Огірок", "Категорія": "Овочі", "Калорії": 15, "Білки": 0.8},
    {"Продукт": "Авокадо", "Категорія": "Фрукти", "Калорії": 160, "Білки": 2.0},
    {"Продукт": "Вівсянка", "Категорія": "Крупи", "Калорії": 389, "Білки": 16.9},
    {"Продукт": "Твердий сир", "Категорія": "Молочні продукти", "Калорії": 402, "Білки": 25.0},
    {"Продукт": "Волоський горіх", "Категорія": "Горіхи", "Калорії": 654, "Білки": 15.2}
]
df = pd.DataFrame(data)
print(f"Всі продукти:\n{df}")
high_calories_df = df[df["Калорії"] > 300]
print(f"Продукти з калорійністю більшою за 300:\n{high_calories_df}")
print(f"Середня кількість білків за категоріями: {df["Білки"].mean()}")
sorted_by_proteins = df.sort_values(by="Білки", ascending=False)
print(f"Посортовані продукти:\n{sorted_by_proteins}")

# завдання 4

data = [
    {"Ім'я": "Максим", "Проект": "Сайт", "Години": 40},
    {"Ім'я": "Ірина", "Проект": "Мобільний додаток", "Години": 35},
    {"Ім'я": "Максим", "Проект": "База даних", "Години": 15},
    {"Ім'я": "Олексій", "Проект": "Сайт", "Години": 20},
    {"Ім'я": "Олена", "Проект": "Дизайн", "Години": 45},
    {"Ім'я": "Ірина", "Проект": "Сайт", "Години": 12},
    {"Ім'я": "Олексій", "Проект": "Мобільний додаток", "Години": 30},
    {"Ім'я": "Дмитро", "Проект": "База даних", "Години": 50},
    {"Ім'я": "Олена", "Проект": "Мобільний додаток", "Години": 10},
    {"Ім'я": "Тарас", "Проект": "Дизайн", "Години": 25}
]
df = pd.DataFrame(data)
print(f"Співробітники з проектами:\n{df}")
hours_per_employee_stats = df.groupby("Ім'я")["Години"].agg(["sum"])
hours_per_employee_stats.columns = ["Кількість годин за співробітником"]
hours_per_project_stats = df.groupby("Проект")["Години"].agg(["sum"])
hours_per_project_stats.columns = ["Кількість годин за проектом"]
print(hours_per_employee_stats)
print(hours_per_project_stats)
top_employee = hours_per_employee_stats["Кількість годин за співробітником"].idxmax()
max_hours = hours_per_employee_stats["Кількість годин за співробітником"].max()
print(f"Співробітник який витратив найбільше годин: {top_employee} ({max_hours} годин)")

# завдання 5

data = [
    {"Фільм": "Дюна", "Місто": "Київ", "Продані квитки": 450},
    {"Фільм": "Початок", "Місто": "Львів", "Продані квитки": 280},
    {"Фільм": "Інтерстеллар", "Місто": "Одеса", "Продані квитки": 190},
    {"Фільм": "Дюна", "Місто": "Харків", "Продані квитки": 310},
    {"Фільм": "Тенет", "Місто": "Київ", "Продані квитки": 220},
    {"Фільм": "Початок", "Місто": "Київ", "Продані квитки": 390},
    {"Фільм": "Інтерстеллар", "Місто": "Львів", "Продані квитки": 340},
    {"Фільм": "Дюна", "Місто": "Львів", "Продані квитки": 400},
    {"Фільм": "Оппенгеймер", "Місто": "Дніпро", "Продані квитки": 150},
    {"Фільм": "Тенет", "Місто": "Одеса", "Продані квитки": 130},
    {"Фільм": "Оппенгеймер", "Місто": "Київ", "Продані квитки": 520},
    {"Фільм": "Початок", "Місто": "Харків", "Продані квитки": 210},
    {"Фільм": "Інтерстеллар", "Місто": "Київ", "Продані квитки": 480},
    {"Фільм": "Дюна", "Місто": "Одеса", "Продані квитки": 260},
    {"Фільм": "Оппенгеймер", "Місто": "Львів", "Продані квитки": 410},
    {"Фільм": "Тенет", "Місто": "Львів", "Продані квитки": 180},
    {"Фільм": "Бетмен", "Місто": "Київ", "Продані квитки": 330},
    {"Фільм": "Бетмен", "Місто": "Харків", "Продані квитки": 170},
    {"Фільм": "Початок", "Місто": "Дніпро", "Продані квитки": 110},
    {"Фільм": "Оппенгеймер", "Місто": "Харків", "Продані квитки": 290},
    {"Фільм": "Бетмен", "Місто": "Львів", "Продані квитки": 250},
    {"Фільм": "Тенет", "Місто": "Харків", "Продані квитки": 140},
    {"Фільм": "Інтерстеллар", "Місто": "Дніпро", "Продані квитки": 95},
    {"Фільм": "Дюна", "Місто": "Дніпро", "Продані квитки": 165},
    {"Фільм": "Оппенгеймер", "Місто": "Одеса", "Продані квитки": 230}
]
df = pd.DataFrame(data)
print(f"Всі продажі квитків:\n{df}")
tickets_sold_by_film_stats = df.groupby("Фільм")["Продані квитки"].agg(["sum"])
tickets_sold_by_film_stats.columns = ["Кількість проданих квитків по фільму"]
print(tickets_sold_by_film_stats)
tickets_sold_by_city_stats = df.groupby("Місто")["Продані квитки"].agg(["sum"])
tickets_sold_by_city_stats.columns = ["Кількість проданих квитків по місту"]
print(tickets_sold_by_city_stats)
top_film = tickets_sold_by_film_stats["Кількість проданих квитків по фільму"].idxmax()
max_tickets_sold = tickets_sold_by_film_stats["Кількість проданих квитків по фільму"].max()
print(f"Фільм на який купили найбільше квитків: {top_film} ({max_tickets_sold})")

# завдання 6

customers_data = [
    {"ID": 1, "Ім'я": "Андрій", "Місто": "Київ"},
    {"ID": 2, "Ім'я": "Марія", "Місто": "Львів"},
    {"ID": 3, "Ім'я": "Олексій", "Місто": "Одеса"},
    {"ID": 4, "Ім'я": "Олена", "Місто": "Харків"},
    {"ID": 5, "Ім'я": "Дмитро", "Місто": "Дніпро"},
    {"ID": 6, "Ім'я": "Ірина", "Місто": "Рівне"},
    {"ID": 7, "Ім'я": "Микола", "Місто": "Полтава"}
]
df_customers = pd.DataFrame(customers_data)
orders_data = [
    {"ID клієнта": 3, "Замовлення": "Кавомашина", "Вартість": 8500},
    {"ID клієнта": 1, "Замовлення": "Ноутбук", "Вартість": 25000},
    {"ID клієнта": 5, "Замовлення": "Крісло", "Вартість": 4500},
    {"ID клієнта": 2, "Замовлення": "Смартфон", "Вартість": 12000},
    {"ID клієнта": 7, "Замовлення": "Клавіатура", "Вартість": 1500},
    {"ID клієнта": 4, "Замовлення": "Пилосос", "Вартість": 5300},
    {"ID клієнта": 6, "Замовлення": "Монітор", "Вартість": 7000}
]
df_orders = pd.DataFrame(orders_data)
print(f"Клієнти:\n{df_customers}")
print(f"Замовлення:\n{df_orders}")
df_merged = pd.merge(df_customers, df_orders, left_on="ID", right_on="ID клієнта", how="inner")
orders_stats = df_merged.groupby("Ім'я")["Замовлення"].agg(["count"])
orders_stats.columns = ["Кількість замовлень"]
df_merged = pd.merge(df_merged, orders_stats, on="Ім'я", how="inner")
df_merged = df_merged.drop(columns=["ID клієнта"])
print(df_merged)